IDEA Open Model
NadSetupValueLong Class
Compatible with IDEA StatiCa 20.1
 Setup value long
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.NadSetupValue
 IdeaRS.OpenModel.Concrete.NadSetupValueLong
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class NadSetupValueLong : NadSetupValue
Public Class NadSetupValueLong
	Inherits NadSetupValue
The NadSetupValueLong type exposes the following members.
Constructors
Name | Description
NadSetupValueLong
Initializes a new instance of the NadSetupValueLong class
Top
Properties
Name | Description
Id
 Gets or sets the value id.
 (Inherited from NadSetupValue.)
IsActive
 Is active
 (Inherited from NadSetupValue.)
Value
 Gets or sets the value.
Top
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace